In [5]:
import pandas as pd

#원본 train 재로딩
titan_df = pd.read_csv('./train.csv')
titan_df.head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

In [14]:
# 컬럼명 추출
titan_df.columns

# Index 객체 추출
indexes =titan_df.index
print(indexes)

# Index 객체를 array로 변환
index_array = indexes.values

RangeIndex(start=0, stop=891, step=1)

In [22]:
## index의 특징
print(type(index_array))
print(index_array.shape)
print(index_array[:4])
print(index_array[5])

# index의 값은 바꿀 수 없다
indexes[0]=100

<class 'numpy.ndarray'>
(891,)
[0 1 2 3]
5

TypeError: Index does not support mutable operations

Series 객체는 Index 객체를 포함하지만, Series 객체에 연산 시에 Index는 연산에서 제외된다. 오직 Index는 식별용이다

In [32]:
titan_df['Pclass'] # series 시리즈
titan_df['Pclass'].value_counts()

# dataframe :: 데이터프레임
titan_df[['Sex','Pclass']].value_counts()

Sex     Pclass
male    3         347
female  3         144
male    1         122
        2         108
female  1          94
        2          76
dtype: int64

In [50]:
# 65세 이상인 여승객만 호출해보자.
titan_df_f = titan_df[(titan_df['Sex']=='female')&(titan_df['Age']>60)]
titan_df_f.reset_index(drop=True,inplace=True) # default는 false입니다.

In [51]:
titan_df_f

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,276,1,1,"Andrews, Miss. Kornelia Theodosia",female,63.0,1,0,13502,77.9583,D7,S
1,484,1,3,"Turkula, Mrs. (Hedwig)",female,63.0,0,0,4134,9.5875,NaN,S
2,830,1,1,"Stone, Mrs. George Nelson (Martha Evelyn)",female,62.0,0,0,113572,80.0000,B28,NaN

In [62]:
### iloc와 loc를 설명해보자 ^^

print(titan_df['Pclass'].head(3))
print(titan_df[['Pclass','Age']].head(3))
# titan_df[0] #[]안에 숫자를 넣으면 key error가 발생


titan_df[0:2] # slicing은 또 됩니다

0    3
1    1
2    3
Name: Pclass, dtype: int64
   Pclass   Age
0       3  22.0
1       1  38.0
2       3  26.0

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

In [79]:
## 위의 cell에서 생성되는 문제를 해결하기 위해
## loc와 iloc를 학습해봅니다 ^^

data = {'Name':['Jung-ho','Yong-hyun','Sea'],
       'Year':[2017,2014,2015],
       'Gender':['Male','Male','Female']}

data_df = pd.DataFrame(data,index=['one','two','three'])
print(data_df)

# # 특정 데이터 추출
# print(data_df.iloc[0,0])
# print(data_df.loc['one','Name'])
# print(data_df.iloc[0:2,[0,1]])
# print(data_df.iloc[0:2,1:2])
# print(data_df.loc[:,['Name','Gender']])
# print(data_df.loc[data_df['Year']>2014])

## 요약 :: loc = 명칭기반 인덱싱(label based indexing)
##      :: iloc = 위치기반 인덱싱(positional indexing)
print('\n명칭 기반 loc slicing\n', data_df.loc['one':'two','Name'],'\n') # 명칭은 그냥 그 명칭까지 slicing
print('위치 기반 iloc slicing\n', data_df.iloc[0:1,0],'\n')

            Name  Year  Gender
one      Jung-ho  2017    Male
two    Yong-hyun  2014    Male
three        Sea  2015  Female

명칭 기반 loc slicing
 one      Jung-ho
two    Yong-hyun
Name: Name, dtype: object

위치 기반 iloc slicing
 one    Jung-ho
Name: Name, dtype: object